let directory = [
    {
        "book":"雪映專集介紹",
        "sub":[
            {"name":"雪映專集介紹"}
        ]
    },
    {
        "book":"十住芳草",
        "sub":[
            {"name":"00 自序"},
            {"name":"01 觀心銘講記"},
            {"name":"02 禪修者的心象"},
            {"name":"03 靜坐調心方法論"},
            {"name":"04 火焰化紅蓮"},
            {"name":"05 論印光大師的淨土思想"},
            {"name":"06 對密教雙修法之評議"},
        ]
    },
    {
        "book":"百步穿楊",
        "sub":[
            {"name":"00 自序"},
            {"name":"01 閒情的逸趣─逸與勞"},
            {"name":"02 悠然的幸福"},
            {"name":"03 性別的超越─男與女"},
            {"name":"04 安穩的步履─鬆與緊"},
            {"name":"05 繽紛的世界─同與異"},
            {"name":"06 平衡的人格─卑與慢"},
            {"name":"07 溝通的藝術─語與默"},
            {"name":"08 行為的導向─慾與律"},
            {"name":"09 道德的規範─善與惡"},
            {"name":"10 命運的堂奧─心與境"},
            {"name":"11 風水的堪究─象與數"},
            {"name":"12 凌雲的雙翼─福與慧"},
            {"name":"13 業障的消除─罪與業"},
            {"name":"14 生命的意義─取與捨"},
            {"name":"15 夢幻的遊戲─生與死"},
            {"name":"16 回頭的道路─正與倒"},
            {"name":"17 進取的指標─道與俗"},
            {"name":"18 心靈的皈處─宗與教"},
            {"name":"19 理事的印證─信與疑"},
            {"name":"20 靈界的訊息─神與人"},
            {"name":"21 成就的因力─自與他"},
            {"name":"22 生命的倫常─縛與解"},
            {"name":"23 永恆的跫音─常與變"},
            {"name":"24 內外的圓融─心與物"},
        ]
    },
    {
        "book":"千江水月",
        "sub":[
            {"name":"01 發心與學佛"},
            {"name":"02 學佛的旨趣"},
            {"name":"03 誠信與正修"},
            {"name":"04 佛教的人生觀"},
            {"name":"05《成佛之道》「布施」偈頌講記"},
            {"name":"06《成佛之道》「持戒」偈頌講記"},
            {"name":"07 《略辨大乘入道四行》講記"},
            {"name":"08 從印度禪、中國禪到現代禪"},
            {"name":"09 主與客"},
            {"name":"10 心之性相體用"},
            {"name":"11 橫行與豎出"},
            {"name":"12 修定與觀慧"},
            {"name":"13 知識與智慧"},
            {"name":"14 知心與寂寞"},
            {"name":"15宗教上的唯美主義與精神分裂"}
        ]
    },
    {
        "book":"萬里雲天",
        "sub":[
            {}
        ]
    },
    {
        "book":"法華經",
        "sub":[
            {}
        ]
    },
    {
        "book":"圓覺經心鑰",
        "sub":[
            {}
        ]
    },
    {
        "book":"如何三養：養老、養病、養死",
        "sub":[
            {}
        ]
    },
    {
        "book":"中觀續雕",
        "sub":[
            {}
        ]
    },
    {
        "book":"金剛經 (上)(下)",
        "sub":[
            {}
        ]
    },
    {
        "book":"般若波羅蜜多心經",
        "sub":[
            {}
        ]
    },
    {
        "book":"腳跟著地",
        "sub":[
            {}
        ]
    },
    {
        "book":"力挽狂瀾",
        "sub":[
            {}
        ]
    },
    {
        "book":"破繭而出",
        "sub":[
            {}
        ]
    },
    {
        "book":"漣珠甘露",
        "sub":[
            {}
        ]
    },
    {
        "book":"楞嚴新粹",
        "sub":[
            {}
        ]
    },
    {
        "book":"禪悟密法",
        "sub":[
            {}
        ]
    },
    {
        "book":"法雲灌頂",
        "sub":[
            {}
        ]
    },
    {
        "book":"天心明月",
        "sub":[
            {}
        ]
    },
    {
        "book":"佛法原典",
        "sub":[
            {}
        ]
    },
    {
        "book":"《攝大乘論》評註與研討",
        "sub":[
            {}
        ]
    },
    {
        "book":"天台小止觀講記",
        "sub":[
            {}
        ]
    },
    {
        "book":"一葦過江",
        "sub":[
            {}
        ]
    },
    {
        "book":"散篇演講",
        "sub":[
            {}
        ]
    },
    {
        "book":"2004禪五開示",
        "sub":[
            {}
        ]
    },
    {
        "book":"2016禪五開示",
        "sub":[
            {}
        ]
    }
]

// {'message':'暂时没有消息','link':'http://daijingong.github.io'},
let notice = [
    {'message':'暂时没有消息'}
]
//notice小红点
let noticeNew = false//true
