let directory = [
    {
        "book":"雪映專集介紹",
        "sub":[
            {"name":"雪映專集介紹"}
        ]
    },
    {
        "book":"十住芳草",
        "sub":[
            {"name":"00 自序"},
            {"name":"01 觀心銘講記"},
            {"name":"02 禪修者的心象"},
            {"name":"03 靜坐調心方法論"},
            {"name":"04 火焰化紅蓮"},
            {"name":"05 論印光大師的淨土思想"},
            {"name":"06 對密教雙修法之評議"},
        ]
    },
    {
        "book":"百步穿楊",
        "sub":[
            {"name":"00 自序"},
            {"name":"01 閒情的逸趣─逸與勞"},
            {"name":"02 悠然的幸福"},
            {"name":"03 性別的超越─男與女"},
            {"name":"04 安穩的步履─鬆與緊"},
            {"name":"05 繽紛的世界─同與異"},
            {"name":"06 平衡的人格─卑與慢"},
            {"name":"07 溝通的藝術─語與默"},
            {"name":"08 行為的導向─慾與律"},
            {"name":"09 道德的規範─善與惡"},
            {"name":"10 命運的堂奧─心與境"},
            {"name":"11 風水的堪究─象與數"},
            {"name":"12 凌雲的雙翼─福與慧"},
            {"name":"13 業障的消除─罪與業"},
            {"name":"14 生命的意義─取與捨"},
            {"name":"15 夢幻的遊戲─生與死"},
            {"name":"16 回頭的道路─正與倒"},
            {"name":"17 進取的指標─道與俗"},
            {"name":"18 心靈的皈處─宗與教"},
            {"name":"19 理事的印證─信與疑"},
            {"name":"20 靈界的訊息─神與人"},
            {"name":"21 成就的因力─自與他"},
            {"name":"22 生命的倫常─縛與解"},
            {"name":"23 永恆的跫音─常與變"},
            {"name":"24 內外的圓融─心與物"},
        ]
    },
    {
        "book":"千江水月",
        "sub":[
            {"name":"01 發心與學佛"},
            {"name":"02 學佛的旨趣"},
            {"name":"03 誠信與正修"},
            {"name":"04 佛教的人生觀"},
            {"name":"05《成佛之道》「布施」偈頌講記"},
            {"name":"06《成佛之道》「持戒」偈頌講記"},
            {"name":"07 《略辨大乘入道四行》講記"},
            {"name":"08 從印度禪、中國禪到現代禪"},
            {"name":"09 主與客"},
            {"name":"10 心之性相體用"},
            {"name":"11 橫行與豎出"},
            {"name":"12 修定與觀慧"},
            {"name":"13 知識與智慧"},
            {"name":"14 知心與寂寞"},
            {"name":"15宗教上的唯美主義與精神分裂"}
        ]
    },
    {
        "book":"萬里雲天",
        "sub":[
            {"name":"01 開心自不在"},
            {"name":"02 歸依三寶之究竟義"},
            {"name":"03 經是佛親口說的嗎"},
            {"name":"04 《小品般若波羅蜜經》引言"},
            {"name":"05 中觀論序"},
            {"name":"06 大乘佛法概說"},
            {"name":"07 普賢十大願"},
        ]
    },
    {
        "book":"法華經",
        "sub":[
            {"name":"00 法華經開題(一)"},
            {"name":"00 法華經開題(二)"},
            {"name":"01 序品"},
            {"name":"02 方便品"},
            {"name":"03 譬喻品"},
            {"name":"04 信解品"},
            {"name":"05 藥草喻品"},
            {"name":"06 授記品"},
            {"name":"07 化城喻品"},
            {"name":"08 五百弟子受記品"},
            {"name":"09 授學無學人記品"},
            {"name":"10 法師品"},
            {"name":"11 常不輕菩薩品"},
            {"name":"12 見寶塔品"},
            {"name":"13 勸持品"},
            {"name":"14 安樂行品"},
            {"name":"15 從地湧出品"},
            {"name":"16 如來壽量品"},
            {"name":"17 分別功德品"},
            {"name":"18 藥王本事品"},
            {"name":"19 普賢勸發品"}
        ]
    },
    {
        "book":"圓覺經心鑰",
        "sub":[
            {"name":"00 圓覺經開題"},
            {"name":"01 圓覺經證信序"},
            {"name":"02 文殊師利菩薩章"},
            {"name":"03 普賢菩薩章"},
            {"name":"04 普眼菩薩章"},
            {"name":"05 金剛藏菩薩章"},
            {"name":"06 彌勒菩薩章"},
            {"name":"07 清淨慧菩薩章"},
            {"name":"08 威德自在菩薩章"},
            {"name":"09 辨音菩薩章"},
            {"name":"10 淨諸業障菩薩章"},
            {"name":"11 普覺菩薩章"},
            {"name":"12 圓覺菩薩章"},
            {"name":"13 賢善首菩薩章"},
        ]
    },
    {
        "book":"如何三養：養老、養病、養死",
        "sub":[
            {"name":"如何三養：養老、養病、養死"}
        ]
    },
    {
        "book":"中觀續雕",
        "sub":[
            {"name":"00.開場白"},
            {"name":"01.觀因緣品"},
            {"name":"02.觀因果品"},
            {"name":"03.觀六情品"},
            {"name":"04.觀五陰品"},
            {"name":"05.觀六種品"},
            {"name":"06.觀本住品"},
            {"name":"07.觀作作者品"},
            {"name":"08.觀染染者品"},
            {"name":"09.觀然可然品"},
            {"name":"11.觀業品"},
            {"name":"12.觀行品"},
            {"name":"13.觀合品"},
            {"name":"14.觀十二因緣品"},
            {"name":"15.觀本際品"},
            {"name":"16.觀時品"},
            {"name":"17.觀三相品"},
            {"name":"18.觀成壞品"},
            {"name":"19.觀去來品"},
            {"name":"20.觀有無品"},
            {"name":"21.觀四諦品"},
            {"name":"22.觀法品"},
            {"name":"23.觀邪見品"},
            {"name":"24.觀縛解品"},
            {"name":"25.觀顛倒品"},
            {"name":"26.觀如來品"},
            {"name":"27.觀涅槃品"}
        ]
    },
    {
        "book":"金剛經 (上)(下)",
        "sub":[
            {"name":"金剛經 (上)"},
            {"name":"金剛經 (下)"}
        ]
    },
    {
        "book":"般若波羅蜜多心經",
        "sub":[
            {"name":"般若波羅蜜多心經"}
        ]
    },
    {
        "book":"腳跟著地",
        "sub":[
            {"name":"數息的變化"},
            {"name":"逆障的超越"},
            {"name":"氣脈的通調"},
            {"name":"觀參的妙用"},
            {"name":"觀念的提昇"},
            {"name":"外延的準則"},
            {"name":"雙溪聖南寺禪修開示"},
            {"name":"師生答問拾珍"},
            {"name":"死與活"},
            {"name":"身與心"},
            {"name":"福與慧"},
            {"name":"禪與淨"}
        ]
    },
    {
        "book":"力挽狂瀾",
        "sub":[
            {"name":"禪修對現代的意義"},
            {"name":"溈山戀夢"},
            {"name":"世間與菩提"},
            {"name":"不以覺受論功夫"},
            {"name":"知與無知"},
            {"name":"八風吹不動"},
            {"name":"頓悟與漸修"},
            {"name":"南泉養貓"},
            {"name":"問世間情是何物之一"},
            {"name":"問世間情是何物之二"},
            {"name":"問世間情是何物之三"}
        ]
    },
    {
        "book":"破繭而出",
        "sub":[
            {"name":"開場白"},
            {"name":"發心學佛"},
            {"name":"信徒在那"},
            {"name":"出家形象"},
            {"name":"出家包袱"},
            {"name":"行持律儀"},
            {"name":"佛教律制"},
            {"name":"修定調心"},
            {"name":"通塞與覺受"},
            {"name":"智慧解脫"},
            {"name":"智慧的修證"},
            {"name":"菩薩道之一"},
            {"name":"菩薩道之二"},
            {"name":"我對菩薩道的省思"},
            {"name":"於末法時代應有的警覺"},
            {"name":"總結"}
        ]
    },
    {
        "book":"漣珠甘露",
        "sub":[
            {"name":"序言"},
            {"name":"專注與遍佈"},
            {"name":"從數息到內觀"},
            {"name":"從內觀到參禪"},
            {"name":"略述禪宗的印證心法"},
            {"name":"我是誰─無我的提昇與修證"},
            {"name":"從性情的調適看修行法門"},
            {"name":"從對位與流行，觀法界之莊嚴"},
            {"name":"從上求與下化，發菩薩之行願"},
            {"name":"淨土思想校正"},
            {"name":"念佛與十方淨土"},
            {"name":"彌陀淨土的層次"},
            {"name":"從菩薩道到成佛"}
        ]
    },
    {
        "book":"楞嚴新粹",
        "sub":[
            {"name":"引言"},
            {"name":"從「無始無明」到「本來清淨」"},
            {"name":"真心與妄識"},
            {"name":"八識表解"},
            {"name":"廿五圓通"},
            {"name":"耳根圓通與參禪法門"},
            {"name":"三無漏學與四清淨明誨"},
            {"name":"五十陰魔"}
        ]
    },
    {
        "book":"禪悟密法",
        "sub":[
            {"name":"引言"},
            {"name":"從滿頭霧水到大悟徹底"},
            {"name":"從參禪、入中脈、透頂到開悟"},
            {"name":"兩類話頭的參法"},
            {"name":"疑情與道心"},
            {"name":"正氣與第三鼻"},
            {"name":"中脈的層次"},
            {"name":"正經、奇經與中脈"},
            {"name":"參禪的時機"},
            {"name":"止觀與大手印"},
            {"name":"總結：中道與法身"},
            {"name":"歇後語"}
        ]
    },
    {
        "book":"法雲灌頂",
        "sub":[
            {"name":"誰是善知識"},
            {"name":"打開心中的結"},
            {"name":"用心與賣力"},
            {"name":"彈性空間"},
            {"name":"開悟與解脫"},
            {"name":"黃巢過後，還收得劍否？"},
            {"name":"確認死亡的正面意義？"},
            {"name":"評月溪法師的《大乘絕對論》"},
            {"name":"觀門入道"},
            {"name":"絕後復甦 (不要你)"},
            {"name":"無頭野鬼，安心自在"},
            {"name":"安心立命於資訊時代"}
        ]
    },
    {
        "book":"天心明月",
        "sub":[
            {"name":"自序"},
            {"name":"禪的藝術"},
            {"name":"幸福貼心"},
            {"name":"照顧腳下"},
            {"name":"真情無限"},
            {"name":"坦誠團體"},
            {"name":"新年談歲"},
            {"name":"休閒與品味"},
            {"name":"獨裁與奴才"},
            {"name":"安平與刺激"},
            {"name":"共識與自在"},
            {"name":"輕鬆與放逸"},
            {"name":"完美與殘缺"},
            {"name":"煩惱與菩提"},
            {"name":"茫忙與恬閒"},
            {"name":"格式與局限"},
            {"name":"了願與消業"},
            {"name":"佛法與企業"},
            {"name":"佛法與管理"},
            {"name":"愛心的真義"},
            {"name":"富貴長在、慧命永存"},
            {"name":"禪與人生"}
        ]
    },
    {
        "book":"佛法原典",
        "sub":[
            {"name":"序言之一"},
            {"name":"序言之二"},
            {"name":"五陰誦"},
            {"name":"六入處誦"},
            {"name":"雜因誦"},
            {"name":"道品誦"},
            {"name":"八眾誦"},
            {"name":"弟子所說誦"},
            {"name":"如來所說誦"}
        ]
    },
    {
        "book":"《攝大乘論》評註",
        "sub":[
            {"name":"第一章"},
            {"name":"第二章之一"},
            {"name":"第二章之二"},
            {"name":"第二章之三"},
            {"name":"第二章之四"},
            {"name":"第三章之一"},
            {"name":"第三章之二"},
            {"name":"第三章之三"}
        ]
    },
    {
        "book":"《攝大乘論》研討",
        "sub":[
            {"name":"2008年 9月 6日"},
            {"name":"2008年 9月20日"},
            {"name":"2008年10月 4日"},
            {"name":"2008年10月18日"},
            {"name":"2008年11月 8日"},
            {"name":"2008年11月22日"},
            {"name":"2008年11月 6日"},
            {"name":"2008年12月20日"},
            {"name":"2009年 1月18日"},
            {"name":"2009年 2月21日"},
            {"name":"2009年 3月 7日上"},
            {"name":"2009年 3月 7日下"},
            {"name":"2009年 3月 21日"},
            {"name":"2009年 4月 4日"},
            {"name":"2009年 4月 18日"},
            {"name":"2009年 5月 9日"},
            {"name":"2009年 5月 23日"},
            {"name":"2009年 6月 13日"}
        ]
    },
    {
        "book":"天台小止觀講記",
        "sub":[
            {"name":"天台小止觀講記"}
        ]
    },
    {
        "book":"一葦過江",
        "sub":[
            {"name":"一葦過江"}
        ]
    },
    {
        "book":"散篇演講",
        "sub":[
            {"name":"攝心與消心"},
            {"name":"如何將「修行」落實在生活當中"},
            {"name":"再談淨土法門"},
            {"name":"從中觀看唯識"},
            {"name":"行門的切要處"},
            {"name":"禪修與八正道"},
            {"name":"從禪的觀點看淨土"},
            {"name":"菩薩道之離合"},
            {"name":"禪修─從健康到覺悟之路"},
            {"name":"三心一觀"},
            {"name":"大乘的精義"},
            {"name":"智慧的修練"},
            {"name":"從中觀思想看如來藏"},
            {"name":"云何為「修行」"},
            {"name":"從思惟到不思惟"},
            {"name":"空觀、中觀和總相觀"},
            {"name":"從指月的比喻，看學佛的旨趣"},
            {"name":"無明風動的比喻"},
            {"name":"求「無所求」"},
            {"name":"禪在坐，不在坐？"},
            {"name":"參疑情與調氣脈"},
            {"name":"從情識的轉化，看寂靜涅槃"},
            {"name":"調氣脈對應禪定的層次"},
            {"name":"以內攝法超脫生死的苦厄"},
            {"name":"修觀與參話頭"},
            {"name":"如何快樂過生活"},
            {"name":"安樂死的進化論"},
            {"name":"諸乘之發心與類別"},
            {"name":"新冠病毒感言"}
        ]
    },
    {
        "book":"2004禪五開示",
        "sub":[
            {"name":"安全感"},
            {"name":"人際關係的離合"},
            {"name":"自我實現"}
        ]
    },
    {
        "book":"2016禪五開示",
        "sub":[
            {"name":"佈施度"},
            {"name":"持戒度"},
            {"name":"智慧度"},
            {"name":"禪定度"}
        ]
    },
    {
        "book":"《三寶山靈嚴禪寺禪修開示》",
        "sub":[
            {"name":"昏沉"},
            {"name":"從缺憾營求到感恩回饋"},
            {"name":"統一與獨立"},
            {"name":"置心無處"}
        ]
    },
    {
        "book":"《勝鬘經》開示",
        "sub":[
            {"name":"《開題、譯文注釋》"},
            {"name":"開示之一《序分、十受章》"},
            {"name":"開示之二《三願章、攝受章》"},
            {"name":"開示之三《一乘章(上)》"},
            {"name":"開示之四《一乘章(下)》"},
            {"name":"開示之五《無邊聖諦章、如來藏章、法身章、空義隱覆真實章、一諦章》"},
            {"name":"開示之六《一依章、顛倒真實章、自性清淨章、如來真子章、勝鬘章》"},
        ]
    },
    {
        "book":"《中阿含》",
        "sub":[
            {"name":"《中阿含》(一) "},
            {"name":"《中阿含》(二) "},
            {"name":"《中阿含》(三) "},
            {"name":"《中阿含》(四) "},
            {"name":"《中阿含》(五) "},
            {"name":"《中阿含》(六) "},
            {"name":"《中阿含》(七) "},
            {"name":"《中阿含》(八) "}
        ]
    },
    {
        "book":"《寶積經》",
        "sub":[
            {"name":"《寶積經》"}
        ]
    },
    {
        "book":"《善生經》",
        "sub":[
            {"name":"《善生經》"}
        ]
    }
]

// {'message':'暂时没有消息','link':'http://daijingong.github.io'},
let notice = [
    {'message':'暂时没有消息'}
]
//notice小红点
let noticeNew = false//true
